FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/sys_reg.h
     * |        |          |0 = Power level change is completed.
     * |        |          |1 = Power level change is ongoing.
     * |[1]     |MVRCBUSY  |Main Voltage Regulator Type Change Busy Bit (Read Only)
     * |        |          |This bit is set by hardware when main voltage regulator type is changing.
     * |        |          |After main voltage regulator type change is completed, this bit will be cleared automatically by hardware.
     * |        |          |0 = Main voltage regulator type change is completed.
     * |        |          |1 = Main voltage regulator type change is ongoing.
     * |[2]     |MVRCERR   |Main Voltage Regulator Type Change Error Bit (Write Protect)
     * |        |          |This bit is set to 1 when main voltage regulator type change from LDO to DCDC error, the following conditions will cause change errors:
     * |        |          |1.System change to DC-DC mode but LDO change voltage process not finish.
     * |        |          |2.Detect inductor fail.
     * |        |          |Read:
     * |        |          |0 = No main voltage regulator type change error.
     * |        |          |1 = Main voltage regulator type change to DCDC error occurred.
     * |        |          |Write:
     * |        |          |0 = No effect.
     * |        |          |1 = Clears MVRCERR to 0.
     * |        |          |Note: This bit is write protected. Refer to the SYS_REGLCTL register.
     * |[3]     |LCONS     |Inductor for DC-DC Connect Status (Read Only)
     * |        |          |0 = Inductor connect between Vsw and LDO_CAP pin.
     * |        |          |This bit is valid when current main voltage regulator type is DCDC (CURMVRS (SYS_PLSTS[12])=1). If current main voltage regulator type is LDO (CURMVRS (SYS_PLSTS[12])=0), this bit is set to 1.
     * |        |          |0 = Inductor connect between Vsw and LDO_CAP pin.
     * |        |          |1 = No Inductor connect between Vsw and LDO_CAP pin.
     * |        |          |Note: This bit is 1 when main viltage regulator is LDO.
     * |[4]     |PDINVTRF  |Power-down Mode Invalid Transition Flag (Write Protect)
     * |        |          |This bit is set by hardware if the requested active DCDC mode to Power-down mode transition is invalid.
     * |        |          |This transition request will be aborted by hardware.
     * |        |          |The bit can be cleared by software.
     * |        |          |Read:
     * |        |          |0 = No Power-down mode invalid transition.
     * |        |          |1 = Power-down mode invalid transition occurred.
     * |        |          |Write:
     * |        |          |0 = No effect.
     * |        |          |1 = Clears this bit to 0.
     * |        |          |Note: This bit is write protected. Refer to the SYS_REGLCTL register.
     * |[9:8]   |PLSTATUS  |Power Level Status (Read Only)
     * |        |          |This bit field reflect the current power level.
     * |        |          |00 = Power level is PL0.
     * |        |          |01 = Power level is PL1.
     * |        |          |Others = Reserved.
     * |[12]    |CURMVR    |Current Main Voltage Regulator Type (Read Only)
     * |        |          |This bit field reflects current main voltage regulator type.
     * |        |          |0 = Current main voltage regulator in active and Idle mode is LDO.
     * |        |          |1 = Current main voltage regulator in active mode and Idle is DCDC.
     * @var SYS_T::AHBMCTL
     * Offset: 0x400  AHB Bus Matrix Priority Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |INTACTEN  |Highest AHB Bus Priority of Cortex-M23 Core Enable Bit (Write Protect)
     * |        |          |Enable Cortex-M23 core with highest AHB bus priority in AHB bus matrix.
     * |        |          |0 = Run robin mode.
     * |        |          |1 = Cortex-M23 CPU with highest bus priority when interrupt occurs.
     * |        |          |Note: This bit is write protected. Refer to the SYS_REGLCTL register.
     */

    __I uint32_t PDID;      /*!< [0x0000] Part Device Identification Number Register                       */
    __IO uint32_t RSTSTS;   /*!< [0x0004] System Reset Status Register                                     */
    __IO uint32_t IPRST0;   /*!< [0x0008] Peripheral  Reset Control Register 0                             */
    __IO uint32_t IPRST1;   /*!< [0x000c] Peripheral Reset Control Register 1                              */
    __IO uint32_t IPRST2;   /*!< [0x0010] Peripheral Reset Control Register 2                              */
    __I uint32_t RESERVE0[ 1 ];
    __IO uint32_t BODCTL;   /*!< [0x0018] Brown-out Detector Control Register                              */
    __IO uint32_t IVSCTL;   /*!< [0x001c] Internal Voltage Source Control Register                         */
    __I uint32_t RESERVE1[ 1 ];
    __IO uint32_t PORCTL0;  /*!< [0x0024] Power-on Reset Controller Register 0                             */
    __IO uint32_t VREFCTL;  /*!< [0x0028] VREF Control Register                                            */
    __IO uint32_t USBPHY;   /*!< [0x002C] USB PHY Control Register                                         */
    __IO uint32_t GPA_MFPL; /*!< [0x0030] GPIOA Low Byte Multiple Function Control Register                */
    __IO uint32_t GPA_MFPH; /*!< [0x0034] GPIOA High Byte Multiple Function Control Register               */
    __IO uint32_t GPB_MFPL; /*!< [0x0038] GPIOB Low Byte Multiple Function Control Register                */
    __IO uint32_t GPB_MFPH; /*!< [0x003c] GPIOB High Byte Multiple Function Control Register               */
    __IO uint32_t GPC_MFPL; /*!< [0x0040] GPIOC Low Byte Multiple Function Control Register                */
    __IO uint32_t GPC_MFPH; /*!< [0x0044] GPIOC High Byte Multiple Function Control Register               */
    __IO uint32_t GPD_MFPL; /*!< [0x0048] GPIOD Low Byte Multiple Function Control Register                */
    __IO uint32_t GPD_MFPH; /*!< [0x004c] GPIOD High Byte Multiple Function Control Register               */
    __IO uint32_t GPE_MFPL; /*!< [0x0050] GPIOE Low Byte Multiple Function Control Register                */
    __IO uint32_t GPE_MFPH; /*!< [0x0054] GPIOE High Byte Multiple Function Control Register               */
    __IO uint32_t GPF_MFPL; /*!< [0x0058] GPIOF Low Byte Multiple Function Control Register                */
    __IO uint32_t GPF_MFPH; /*!< [0x005C] GPIOF High Byte Multiple Function Control Register               */
    __IO uint32_t GPG_MFPL; /*!< [0x0060] GPIOG Low Byte Multiple Function Control Register                */
    __IO uint32_t GPG_MFPH; /*!< [0x0064] GPIOG High Byte Multiple Function Control Register               */
    __IO uint32_t GPH_MFPL; /*!< [0x0068] GPIOH Low Byte Multiple Function Control Register                */
    __IO uint32_t GPH_MFPH; /*!< [0x006C] GPIOH High Byte Multiple Function Control Register               */
    __I uint32_t RESERVE2[ 4 ];
    __IO uint32_t GPA_MFOS; /*!< [0x0080] GPIOA Multiple Function Output Select Register                   */
    __IO uint32_t GPB_MFOS; /*!< [0x0084] GPIOB Multiple Function Output Select Register                   */
    __IO uint32_t GPC_MFOS; /*!< [0x0088] GPIOC Multiple Function Output Select Register                   */
    __IO uint32_t GPD_MFOS; /*!< [0x008c] GPIOD Multiple Function Output Select Register                   */
    __IO uint32_t GPE_MFOS; /*!< [0x0090] GPIOE Multiple Function Output Select Register                   */
    __IO uint32_t GPF_MFOS; /*!< [0x0094] GPIOF Multiple Function Output Select Register                   */
    __IO uint32_t GPG_MFOS; /*!< [0x0098] GPIOG Multiple Function Output Select Register                   */
    __IO uint32_t GPH_MFOS; /*!< [0x009c] GPIOH Multiple Function Output Select Register                   */
    __I uint32_t RESERVE3[ 8 ];
    __IO uint32_t SRAMICTL; /*!< [0x00C0] System SRAM Interrupt Enable Control Register                    */
    __IO uint32_t SRAMSTS;  /*!< [0x00C4] System SRAM Parity Error Status Register                         */
    __IO uint32_t SRAMEADR; /*!< [0x00C8] System SRAM Parity Check Error Address Register                  */
    __IO uint32_t RESERVE4[ 4 ];
    __IO uint32_t SRAMPCTL; /*!< [0x00DC] System SRAM Power Mode Control Register                          */
    __IO uint32_t SRAMPPCT; /*!< [0x00E0] Peripheral SRAM Power Mode Control Register                      */
    __IO uint32_t TCTL48M;  /*!< [0x00E4] HIRC 48M Trim Control Register                                   */
    __IO uint32_t TIEN48M;  /*!< [0x00E8] HIRC 48M Trim Interrupt Enable Register                          */
    __IO uint32_t TISTS48M; /*!< [0x00EC] HIRC 48M Trim Interrupt Status Register                          */
    __IO uint32_t TCTL12M;  /*!< [0x00F0] HIRC 12M Trim Control Register                                   */
    __IO uint32_t TIEN12M;  /*!< [0x00F4] HIRC 12M Trim Interrupt Enable Register                          */
    __IO uint32_t TISTS12M; /*!< [0x00F8] HIRC 12M Trim Interrupt Status Register                          */
    __I uint32_t RESERVE6[ 1 ];
    __IO uint32_t REGLCTL;  /*!< [0x0100] Register Lock Control Register                                   */
    __I uint32_t RESERVE7[ 58 ];
    __IO uint32_t PORCTL1;  /*!< [0x01EC] Power-on Reset Controller Register 1                             */
    __I uint32_t RESERVE8[ 2 ];
    __IO uint32_t PLCTL;    /*!< [0x01F8] Power Level Control Register                                     */
    __IO uint32_t PLSTS;    /*!< [0x01FC] Power Level Status Register                                      */
    __I uint32_t RESERVE9[ 128 ];
    __IO uint32_t AHBMCTL;  /*!< [0x0400] AHB Bus Matrix Priority Control Register                         */
} SYS_T;

/**
 *  @addtogroup SYS_CONST SYS Bit Field Definition
 *  Constant Definitions for SYS Controller
 * @{ */

#define SYS_PDID_PDID_Pos             ( 0 )                                                /*!< SYS_T::PDID: PDID Position             */
#define SYS_PDID_PDID_Msk             ( 0xfffffffful << SYS_PDID_PDID_Pos )                /*!< SYS_T::PDID: PDID Mask                 */

#define SYS_RSTSTS_PORF_Pos           ( 0 )                                                /*!< SYS_T::RSTSTS: PORF Position           */
#define SYS_RSTSTS_PORF_Msk           ( 0x1ul << SYS_RSTSTS_PORF_Pos )                     /*!< SYS_T::RSTSTS: PORF Mask               */

#define SYS_RSTSTS_PINRF_Pos          ( 1 )                                                /*!< SYS_T::RSTSTS: PINRF Position          */
#define SYS_RSTSTS_PINRF_Msk          ( 0x1ul << SYS_RSTSTS_PINRF_Pos )                    /*!< SYS_T::RSTSTS: PINRF Mask              */

#define SYS_RSTSTS_WDTRF_Pos          ( 2 )                                                /*!< SYS_T::RSTSTS: WDTRF Position          */
#define SYS_RSTSTS_WDTRF_Msk          ( 0x1ul << SYS_RSTSTS_WDTRF_Pos )                    /*!< SYS_T::RSTSTS: WDTRF Mask              */

#define SYS_RSTSTS_LVRF_Pos           ( 3 )                                                /*!< SYS_T::RSTSTS: LVRF Position           */
#define SYS_RSTSTS_LVRF_Msk           ( 0x1ul << SYS_RSTSTS_LVRF_Pos )                     /*!< SYS_T::RSTSTS: LVRF Mask               */

#define SYS_RSTSTS_BODRF_Pos          ( 4 )                                                /*!< SYS_T::RSTSTS: BODRF Position          */
#define SYS_RSTSTS_BODRF_Msk          ( 0x1ul << SYS_RSTSTS_BODRF_Pos )                    /*!< SYS_T::RSTSTS: BODRF Mask              */

