FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/sys_reg.h
#define SYS_RSTSTS_SYSRF_Pos          ( 5 )                                                /*!< SYS_T::RSTSTS: SYSRF Position          */
#define SYS_RSTSTS_SYSRF_Msk          ( 0x1ul << SYS_RSTSTS_SYSRF_Pos )                    /*!< SYS_T::RSTSTS: SYSRF Mask              */

#define SYS_RSTSTS_CPURF_Pos          ( 7 )                                                /*!< SYS_T::RSTSTS: CPURF Position          */
#define SYS_RSTSTS_CPURF_Msk          ( 0x1ul << SYS_RSTSTS_CPURF_Pos )                    /*!< SYS_T::RSTSTS: CPURF Mask              */

#define SYS_RSTSTS_CPULKRF_Pos        ( 8 )                                                /*!< SYS_T::RSTSTS: CPULKRF Position        */
#define SYS_RSTSTS_CPULKRF_Msk        ( 0x1ul << SYS_RSTSTS_CPULKRF_Pos )                  /*!< SYS_T::RSTSTS: CPULKRF Mask            */

#define SYS_IPRST0_CHIPRST_Pos        ( 0 )                                                /*!< SYS_T::IPRST0: CHIPRST Position        */
#define SYS_IPRST0_CHIPRST_Msk        ( 0x1ul << SYS_IPRST0_CHIPRST_Pos )                  /*!< SYS_T::IPRST0: CHIPRST Mask            */

#define SYS_IPRST0_CPURST_Pos         ( 1 )                                                /*!< SYS_T::IPRST0: CPURST Position         */
#define SYS_IPRST0_CPURST_Msk         ( 0x1ul << SYS_IPRST0_CPURST_Pos )                   /*!< SYS_T::IPRST0: CPURST Mask             */

#define SYS_IPRST0_PDMA0RST_Pos       ( 2 )                                                /*!< SYS_T::IPRST0: PDMA0RST Position       */
#define SYS_IPRST0_PDMA0RST_Msk       ( 0x1ul << SYS_IPRST0_PDMA0RST_Pos )                 /*!< SYS_T::IPRST0: PDMA0RST Mask           */

#define SYS_IPRST0_EBIRST_Pos         ( 3 )                                                /*!< SYS_T::IPRST0: EBIRST Position         */
#define SYS_IPRST0_EBIRST_Msk         ( 0x1ul << SYS_IPRST0_EBIRST_Pos )                   /*!< SYS_T::IPRST0: EBIRST Mask             */

#define SYS_IPRST0_USBHRST_Pos        ( 4 )                                                /*!< SYS_T::IPRST0: USBHRST Position        */
#define SYS_IPRST0_USBHRST_Msk        ( 0x1ul << SYS_IPRST0_USBHRST_Pos )                  /*!< SYS_T::IPRST0: USBHRST Mask            */

#define SYS_IPRST0_SDH0RST_Pos        ( 6 )                                                /*!< SYS_T::IPRST0: SDH0RST Position        */
#define SYS_IPRST0_SDH0RST_Msk        ( 0x1ul << SYS_IPRST0_SDH0RST_Pos )                  /*!< SYS_T::IPRST0: SDH0RST Mask            */

#define SYS_IPRST0_CRCRST_Pos         ( 7 )                                                /*!< SYS_T::IPRST0: CRCRST Position         */
#define SYS_IPRST0_CRCRST_Msk         ( 0x1ul << SYS_IPRST0_CRCRST_Pos )                   /*!< SYS_T::IPRST0: CRCRST Mask             */

#define SYS_IPRST0_CRPTRST_Pos        ( 12 )                                               /*!< SYS_T::IPRST0: CRPTRST Position        */
#define SYS_IPRST0_CRPTRST_Msk        ( 0x1ul << SYS_IPRST0_CRPTRST_Pos )                  /*!< SYS_T::IPRST0: CRPTRST Mask            */

#define SYS_IPRST0_PDMA1RST_Pos       ( 29 )                                               /*!< SYS_T::IPRST0: PDMA1RST Position       */
#define SYS_IPRST0_PDMA1RST_Msk       ( 0x1ul << SYS_IPRST0_PDMA1RST_Pos )                 /*!< SYS_T::IPRST0: PDMA1RST Mask           */

#define SYS_IPRST1_GPIORST_Pos        ( 1 )                                                /*!< SYS_T::IPRST1: GPIORST Position        */
#define SYS_IPRST1_GPIORST_Msk        ( 0x1ul << SYS_IPRST1_GPIORST_Pos )                  /*!< SYS_T::IPRST1: GPIORST Mask            */

#define SYS_IPRST1_TMR0RST_Pos        ( 2 )                                                /*!< SYS_T::IPRST1: TMR0RST Position        */
#define SYS_IPRST1_TMR0RST_Msk        ( 0x1ul << SYS_IPRST1_TMR0RST_Pos )                  /*!< SYS_T::IPRST1: TMR0RST Mask            */

#define SYS_IPRST1_TMR1RST_Pos        ( 3 )                                                /*!< SYS_T::IPRST1: TMR1RST Position        */
#define SYS_IPRST1_TMR1RST_Msk        ( 0x1ul << SYS_IPRST1_TMR1RST_Pos )                  /*!< SYS_T::IPRST1: TMR1RST Mask            */

#define SYS_IPRST1_TMR2RST_Pos        ( 4 )                                                /*!< SYS_T::IPRST1: TMR2RST Position        */
#define SYS_IPRST1_TMR2RST_Msk        ( 0x1ul << SYS_IPRST1_TMR2RST_Pos )                  /*!< SYS_T::IPRST1: TMR2RST Mask            */

#define SYS_IPRST1_TMR3RST_Pos        ( 5 )                                                /*!< SYS_T::IPRST1: TMR3RST Position        */
#define SYS_IPRST1_TMR3RST_Msk        ( 0x1ul << SYS_IPRST1_TMR3RST_Pos )                  /*!< SYS_T::IPRST1: TMR3RST Mask            */

#define SYS_IPRST1_ACMP01RST_Pos      ( 7 )                                                /*!< SYS_T::IPRST1: ACMP01RST Position      */
#define SYS_IPRST1_ACMP01RST_Msk      ( 0x1ul << SYS_IPRST1_ACMP01RST_Pos )                /*!< SYS_T::IPRST1: ACMP01RST Mask          */

#define SYS_IPRST1_I2C0RST_Pos        ( 8 )                                                /*!< SYS_T::IPRST1: I2C0RST Position        */
#define SYS_IPRST1_I2C0RST_Msk        ( 0x1ul << SYS_IPRST1_I2C0RST_Pos )                  /*!< SYS_T::IPRST1: I2C0RST Mask            */

#define SYS_IPRST1_I2C1RST_Pos        ( 9 )                                                /*!< SYS_T::IPRST1: I2C1RST Position        */
#define SYS_IPRST1_I2C1RST_Msk        ( 0x1ul << SYS_IPRST1_I2C1RST_Pos )                  /*!< SYS_T::IPRST1: I2C1RST Mask            */

#define SYS_IPRST1_I2C2RST_Pos        ( 10 )                                               /*!< SYS_T::IPRST1: I2C2RST Position        */
#define SYS_IPRST1_I2C2RST_Msk        ( 0x1ul << SYS_IPRST1_I2C2RST_Pos )                  /*!< SYS_T::IPRST1: I2C2RST Mask            */

#define SYS_IPRST1_QSPI0RST_Pos       ( 12 )                                               /*!< SYS_T::IPRST1: QSPI0RST Position       */
#define SYS_IPRST1_QSPI0RST_Msk       ( 0x1ul << SYS_IPRST1_QSPI0RST_Pos )                 /*!< SYS_T::IPRST1: QSPI0RST Mask           */

#define SYS_IPRST1_SPI0RST_Pos        ( 13 )                                               /*!< SYS_T::IPRST1: SPI0RST Position        */
#define SYS_IPRST1_SPI0RST_Msk        ( 0x1ul << SYS_IPRST1_SPI0RST_Pos )                  /*!< SYS_T::IPRST1: SPI0RST Mask            */

#define SYS_IPRST1_SPI1RST_Pos        ( 14 )                                               /*!< SYS_T::IPRST1: SPI1RST Position        */
#define SYS_IPRST1_SPI1RST_Msk        ( 0x1ul << SYS_IPRST1_SPI1RST_Pos )                  /*!< SYS_T::IPRST1: SPI1RST Mask            */

#define SYS_IPRST1_SPI2RST_Pos        ( 15 )                                               /*!< SYS_T::IPRST1: SPI2RST Position        */
#define SYS_IPRST1_SPI2RST_Msk        ( 0x1ul << SYS_IPRST1_SPI2RST_Pos )                  /*!< SYS_T::IPRST1: SPI2RST Mask            */

#define SYS_IPRST1_UART0RST_Pos       ( 16 )                                               /*!< SYS_T::IPRST1: UART0RST Position       */
#define SYS_IPRST1_UART0RST_Msk       ( 0x1ul << SYS_IPRST1_UART0RST_Pos )                 /*!< SYS_T::IPRST1: UART0RST Mask           */

#define SYS_IPRST1_UART1RST_Pos       ( 17 )                                               /*!< SYS_T::IPRST1: UART1RST Position       */
#define SYS_IPRST1_UART1RST_Msk       ( 0x1ul << SYS_IPRST1_UART1RST_Pos )                 /*!< SYS_T::IPRST1: UART1RST Mask           */

#define SYS_IPRST1_UART2RST_Pos       ( 18 )                                               /*!< SYS_T::IPRST1: UART2RST Position       */
#define SYS_IPRST1_UART2RST_Msk       ( 0x1ul << SYS_IPRST1_UART2RST_Pos )                 /*!< SYS_T::IPRST1: UART2RST Mask           */

#define SYS_IPRST1_UART3RST_Pos       ( 19 )                                               /*!< SYS_T::IPRST1: UART3RST Position       */
#define SYS_IPRST1_UART3RST_Msk       ( 0x1ul << SYS_IPRST1_UART3RST_Pos )                 /*!< SYS_T::IPRST1: UART3RST Mask           */

