FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/sys_reg.h
#define SYS_IPRST1_UART4RST_Pos       ( 20 )                                               /*!< SYS_T::IPRST1: UART4RST Position       */
#define SYS_IPRST1_UART4RST_Msk       ( 0x1ul << SYS_IPRST1_UART4RST_Pos )                 /*!< SYS_T::IPRST1: UART4RST Mask           */

#define SYS_IPRST1_UART5RST_Pos       ( 21 )                                               /*!< SYS_T::IPRST1: UART5RST Position       */
#define SYS_IPRST1_UART5RST_Msk       ( 0x1ul << SYS_IPRST1_UART5RST_Pos )                 /*!< SYS_T::IPRST1: UART5RST Mask           */

#define SYS_IPRST1_CAN0RST_Pos        ( 24 )                                               /*!< SYS_T::IPRST1: CAN0RST Position        */
#define SYS_IPRST1_CAN0RST_Msk        ( 0x1ul << SYS_IPRST1_CAN0RST_Pos )                  /*!< SYS_T::IPRST1: CAN0RST Mask            */

#define SYS_IPRST1_OTGRST_Pos         ( 26 )                                               /*!< SYS_T::IPRST1: OTGRST Position         */
#define SYS_IPRST1_OTGRST_Msk         ( 0x1ul << SYS_IPRST1_OTGRST_Pos )                   /*!< SYS_T::IPRST1: OTGRST Mask             */

#define SYS_IPRST1_USBDRST_Pos        ( 27 )                                               /*!< SYS_T::IPRST1: USBDRST Position        */
#define SYS_IPRST1_USBDRST_Msk        ( 0x1ul << SYS_IPRST1_USBDRST_Pos )                  /*!< SYS_T::IPRST1: USBDRST Mask            */

#define SYS_IPRST1_EADCRST_Pos        ( 28 )                                               /*!< SYS_T::IPRST1: EADCRST Position        */
#define SYS_IPRST1_EADCRST_Msk        ( 0x1ul << SYS_IPRST1_EADCRST_Pos )                  /*!< SYS_T::IPRST1: EADCRST Mask            */

#define SYS_IPRST1_I2S0RST_Pos        ( 29 )                                               /*!< SYS_T::IPRST1: I2S0RST Position        */
#define SYS_IPRST1_I2S0RST_Msk        ( 0x1ul << SYS_IPRST1_I2S0RST_Pos )                  /*!< SYS_T::IPRST1: I2S0RST Mask            */

#define SYS_IPRST1_TRNGRST_Pos        ( 31 )                                               /*!< SYS_T::IPRST1: TRNGRST Position        */
#define SYS_IPRST1_TRNGRST_Msk        ( 0x1ul << SYS_IPRST1_TRNGRST_Pos )                  /*!< SYS_T::IPRST1: TRNGRST Mask            */

#define SYS_IPRST2_SC0RST_Pos         ( 0 )                                                /*!< SYS_T::IPRST2: SC0RST Position         */
#define SYS_IPRST2_SC0RST_Msk         ( 0x1ul << SYS_IPRST2_SC0RST_Pos )                   /*!< SYS_T::IPRST2: SC0RST Mask             */

#define SYS_IPRST2_SC1RST_Pos         ( 1 )                                                /*!< SYS_T::IPRST2: SC1RST Position         */
#define SYS_IPRST2_SC1RST_Msk         ( 0x1ul << SYS_IPRST2_SC1RST_Pos )                   /*!< SYS_T::IPRST2: SC1RST Mask             */

#define SYS_IPRST2_SC2RST_Pos         ( 2 )                                                /*!< SYS_T::IPRST2: SC2RST Position         */
#define SYS_IPRST2_SC2RST_Msk         ( 0x1ul << SYS_IPRST2_SC2RST_Pos )                   /*!< SYS_T::IPRST2: SC2RST Mask             */

#define SYS_IPRST2_SPI3RST_Pos        ( 6 )                                                /*!< SYS_T::IPRST2: SPI3RST Position        */
#define SYS_IPRST2_SPI3RST_Msk        ( 0x1ul << SYS_IPRST2_SPI3RST_Pos )                  /*!< SYS_T::IPRST2: SPI3RST Mask            */

#define SYS_IPRST2_USCI0RST_Pos       ( 8 )                                                /*!< SYS_T::IPRST2: USCI0RST Position       */
#define SYS_IPRST2_USCI0RST_Msk       ( 0x1ul << SYS_IPRST2_USCI0RST_Pos )                 /*!< SYS_T::IPRST2: USCI0RST Mask           */

#define SYS_IPRST2_USCI1RST_Pos       ( 9 )                                                /*!< SYS_T::IPRST2: USCI1RST Position       */
#define SYS_IPRST2_USCI1RST_Msk       ( 0x1ul << SYS_IPRST2_USCI1RST_Pos )                 /*!< SYS_T::IPRST2: USCI1RST Mask           */

#define SYS_IPRST2_DACRST_Pos         ( 12 )                                               /*!< SYS_T::IPRST2: DACRST Position         */
#define SYS_IPRST2_DACRST_Msk         ( 0x1ul << SYS_IPRST2_DACRST_Pos )                   /*!< SYS_T::IPRST2: DACRST Mask             */

#define SYS_IPRST2_EPWM0RST_Pos       ( 16 )                                               /*!< SYS_T::IPRST2: EPWM0RST Position       */
#define SYS_IPRST2_EPWM0RST_Msk       ( 0x1ul << SYS_IPRST2_EPWM0RST_Pos )                 /*!< SYS_T::IPRST2: EPWM0RST Mask           */

#define SYS_IPRST2_EPWM1RST_Pos       ( 17 )                                               /*!< SYS_T::IPRST2: EPWM1RST Position       */
#define SYS_IPRST2_EPWM1RST_Msk       ( 0x1ul << SYS_IPRST2_EPWM1RST_Pos )                 /*!< SYS_T::IPRST2: EPWM1RST Mask           */

#define SYS_IPRST2_BPWM0RST_Pos       ( 18 )                                               /*!< SYS_T::IPRST2: BPWM0RST Position       */
#define SYS_IPRST2_BPWM0RST_Msk       ( 0x1ul << SYS_IPRST2_BPWM0RST_Pos )                 /*!< SYS_T::IPRST2: BPWM0RST Mask           */

#define SYS_IPRST2_BPWM1RST_Pos       ( 19 )                                               /*!< SYS_T::IPRST2: BPWM1RST Position       */
#define SYS_IPRST2_BPWM1RST_Msk       ( 0x1ul << SYS_IPRST2_BPWM1RST_Pos )                 /*!< SYS_T::IPRST2: BPWM1RST Mask           */

#define SYS_IPRST2_QEI0RST_Pos        ( 22 )                                               /*!< SYS_T::IPRST2: QEI0RST Position        */
#define SYS_IPRST2_QEI0RST_Msk        ( 0x1ul << SYS_IPRST2_QEI0RST_Pos )                  /*!< SYS_T::IPRST2: QEI0RST Mask            */

#define SYS_IPRST2_QEI1RST_Pos        ( 23 )                                               /*!< SYS_T::IPRST2: QEI1RST Position        */
#define SYS_IPRST2_QEI1RST_Msk        ( 0x1ul << SYS_IPRST2_QEI1RST_Pos )                  /*!< SYS_T::IPRST2: QEI1RST Mask            */

#define SYS_IPRST2_ECAP0RST_Pos       ( 26 )                                               /*!< SYS_T::IPRST2: ECAP0RST Position       */
#define SYS_IPRST2_ECAP0RST_Msk       ( 0x1ul << SYS_IPRST2_ECAP0RST_Pos )                 /*!< SYS_T::IPRST2: ECAP0RST Mask           */

#define SYS_IPRST2_ECAP1RST_Pos       ( 27 )                                               /*!< SYS_T::IPRST2: ECAP1RST Position       */
#define SYS_IPRST2_ECAP1RST_Msk       ( 0x1ul << SYS_IPRST2_ECAP1RST_Pos )                 /*!< SYS_T::IPRST2: ECAP1RST Mask           */

#define SYS_BODCTL_BODEN_Pos          ( 0 )                                                /*!< SYS_T::BODCTL: BODEN Position          */
#define SYS_BODCTL_BODEN_Msk          ( 0x1ul << SYS_BODCTL_BODEN_Pos )                    /*!< SYS_T::BODCTL: BODEN Mask              */

#define SYS_BODCTL_BODRSTEN_Pos       ( 3 )                                                /*!< SYS_T::BODCTL: BODRSTEN Position       */
#define SYS_BODCTL_BODRSTEN_Msk       ( 0x1ul << SYS_BODCTL_BODRSTEN_Pos )                 /*!< SYS_T::BODCTL: BODRSTEN Mask           */

#define SYS_BODCTL_BODIF_Pos          ( 4 )                                                /*!< SYS_T::BODCTL: BODIF Position          */
#define SYS_BODCTL_BODIF_Msk          ( 0x1ul << SYS_BODCTL_BODIF_Pos )                    /*!< SYS_T::BODCTL: BODIF Mask              */

#define SYS_BODCTL_BODLPM_Pos         ( 5 )                                                /*!< SYS_T::BODCTL: BODLPM Position         */
#define SYS_BODCTL_BODLPM_Msk         ( 0x1ul << SYS_BODCTL_BODLPM_Pos )                   /*!< SYS_T::BODCTL: BODLPM Mask             */

#define SYS_BODCTL_BODOUT_Pos         ( 6 )                                                /*!< SYS_T::BODCTL: BODOUT Position         */
#define SYS_BODCTL_BODOUT_Msk         ( 0x1ul << SYS_BODCTL_BODOUT_Pos )                   /*!< SYS_T::BODCTL: BODOUT Mask             */

