FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/sys_reg.h
#define SYS_BODCTL_LVREN_Pos          ( 7 )                                                /*!< SYS_T::BODCTL: LVREN Position          */
#define SYS_BODCTL_LVREN_Msk          ( 0x1ul << SYS_BODCTL_LVREN_Pos )                    /*!< SYS_T::BODCTL: LVREN Mask              */

#define SYS_BODCTL_BODDGSEL_Pos       ( 8 )                                                /*!< SYS_T::BODCTL: BODDGSEL Position       */
#define SYS_BODCTL_BODDGSEL_Msk       ( 0x7ul << SYS_BODCTL_BODDGSEL_Pos )                 /*!< SYS_T::BODCTL: BODDGSEL Mask           */

#define SYS_BODCTL_LVRDGSEL_Pos       ( 12 )                                               /*!< SYS_T::BODCTL: LVRDGSEL Position       */
#define SYS_BODCTL_LVRDGSEL_Msk       ( 0x7ul << SYS_BODCTL_LVRDGSEL_Pos )                 /*!< SYS_T::BODCTL: LVRDGSEL Mask           */

#define SYS_BODCTL_BODVL_Pos          ( 16 )                                               /*!< SYS_T::BODCTL: BODVL Position          */
#define SYS_BODCTL_BODVL_Msk          ( 0x7ul << SYS_BODCTL_BODVL_Pos )                    /*!< SYS_T::BODCTL: BODVL Mask              */

#define SYS_IVSCTL_VTEMPEN_Pos        ( 0 )                                                /*!< SYS_T::IVSCTL: VTEMPEN Position        */
#define SYS_IVSCTL_VTEMPEN_Msk        ( 0x1ul << SYS_IVSCTL_VTEMPEN_Pos )                  /*!< SYS_T::IVSCTL: VTEMPEN Mask            */

#define SYS_IVSCTL_VBATUGEN_Pos       ( 1 )                                                /*!< SYS_T::IVSCTL: VBATUGEN Position       */
#define SYS_IVSCTL_VBATUGEN_Msk       ( 0x1ul << SYS_IVSCTL_VBATUGEN_Pos )                 /*!< SYS_T::IVSCTL: VBATUGEN Mask           */

#define SYS_PORCTL0_PORMASK_Pos       ( 0 )                                                /*!< SYS_T::PORCTL0: PORMASK Position       */
#define SYS_PORCTL0_PORMASK_Msk       ( 0xfffful << SYS_PORCTL0_PORMASK_Pos )              /*!< SYS_T::PORCTL0: PORMASK Mask           */

#define SYS_VREFCTL_VREFCTL_Pos       ( 0 )                                                /*!< SYS_T::VREFCTL: VREFCTL Position       */
#define SYS_VREFCTL_VREFCTL_Msk       ( 0x1ful << SYS_VREFCTL_VREFCTL_Pos )                /*!< SYS_T::VREFCTL: VREFCTL Mask           */

#define SYS_VREFCTL_IBIASSEL_Pos      ( 5 )                                                /*!< SYS_T::VREFCTL: IBIASSEL Position      */
#define SYS_VREFCTL_IBIASSEL_Msk      ( 0x1ul << SYS_VREFCTL_IBIASSEL_Pos )                /*!< SYS_T::VREFCTL: IBIASSEL Mask          */

#define SYS_VREFCTL_PRELOADSEL_Pos    ( 6 )                                                /*!< SYS_T::VREFCTL: PRELOADSEL Position    */
#define SYS_VREFCTL_PRELOADSEL_Msk    ( 0x3ul << SYS_VREFCTL_PRELOADSEL_Pos )              /*!< SYS_T::VREFCTL: PRELOADSEL Mask        */

#define SYS_USBPHY_USBROLE_Pos        ( 0 )                                                /*!< SYS_T::USBPHY: USBROLE Position        */
#define SYS_USBPHY_USBROLE_Msk        ( 0x3ul << SYS_USBPHY_USBROLE_Pos )                  /*!< SYS_T::USBPHY: USBROLE Mask            */

#define SYS_USBPHY_SBO_Pos            ( 2 )                                                /*!< SYS_T::USBPHY: SBO Position            */
#define SYS_USBPHY_SBO_Msk            ( 0x1ul << SYS_USBPHY_SBO_Pos )                      /*!< SYS_T::USBPHY: SBO Mask                */

#define SYS_USBPHY_OTGPHYEN_Pos       ( 8 )                                                /*!< SYS_T::USBPHY: OTGPHYEN Position       */
#define SYS_USBPHY_OTGPHYEN_Msk       ( 0x1ul << SYS_USBPHY_OTGPHYEN_Pos )                 /*!< SYS_T::USBPHY: OTGPHYEN Mask           */

#define SYS_GPA_MFPL_PA0MFP_Pos       ( 0 )                                                /*!< SYS_T::GPA_MFPL: PA0MFP Position       */
#define SYS_GPA_MFPL_PA0MFP_Msk       ( 0xful << SYS_GPA_MFPL_PA0MFP_Pos )                 /*!< SYS_T::GPA_MFPL: PA0MFP Mask           */

#define SYS_GPA_MFPL_PA1MFP_Pos       ( 4 )                                                /*!< SYS_T::GPA_MFPL: PA1MFP Position       */
#define SYS_GPA_MFPL_PA1MFP_Msk       ( 0xful << SYS_GPA_MFPL_PA1MFP_Pos )                 /*!< SYS_T::GPA_MFPL: PA1MFP Mask           */

#define SYS_GPA_MFPL_PA2MFP_Pos       ( 8 )                                                /*!< SYS_T::GPA_MFPL: PA2MFP Position       */
#define SYS_GPA_MFPL_PA2MFP_Msk       ( 0xful << SYS_GPA_MFPL_PA2MFP_Pos )                 /*!< SYS_T::GPA_MFPL: PA2MFP Mask           */

#define SYS_GPA_MFPL_PA3MFP_Pos       ( 12 )                                               /*!< SYS_T::GPA_MFPL: PA3MFP Position       */
#define SYS_GPA_MFPL_PA3MFP_Msk       ( 0xful << SYS_GPA_MFPL_PA3MFP_Pos )                 /*!< SYS_T::GPA_MFPL: PA3MFP Mask           */

#define SYS_GPA_MFPL_PA4MFP_Pos       ( 16 )                                               /*!< SYS_T::GPA_MFPL: PA4MFP Position       */
#define SYS_GPA_MFPL_PA4MFP_Msk       ( 0xful << SYS_GPA_MFPL_PA4MFP_Pos )                 /*!< SYS_T::GPA_MFPL: PA4MFP Mask           */

#define SYS_GPA_MFPL_PA5MFP_Pos       ( 20 )                                               /*!< SYS_T::GPA_MFPL: PA5MFP Position       */
#define SYS_GPA_MFPL_PA5MFP_Msk       ( 0xful << SYS_GPA_MFPL_PA5MFP_Pos )                 /*!< SYS_T::GPA_MFPL: PA5MFP Mask           */

#define SYS_GPA_MFPL_PA6MFP_Pos       ( 24 )                                               /*!< SYS_T::GPA_MFPL: PA6MFP Position       */
#define SYS_GPA_MFPL_PA6MFP_Msk       ( 0xful << SYS_GPA_MFPL_PA6MFP_Pos )                 /*!< SYS_T::GPA_MFPL: PA6MFP Mask           */

#define SYS_GPA_MFPL_PA7MFP_Pos       ( 28 )                                               /*!< SYS_T::GPA_MFPL: PA7MFP Position       */
#define SYS_GPA_MFPL_PA7MFP_Msk       ( 0xful << SYS_GPA_MFPL_PA7MFP_Pos )                 /*!< SYS_T::GPA_MFPL: PA7MFP Mask           */

#define SYS_GPA_MFPH_PA8MFP_Pos       ( 0 )                                                /*!< SYS_T::GPA_MFPH: PA8MFP Position       */
#define SYS_GPA_MFPH_PA8MFP_Msk       ( 0xful << SYS_GPA_MFPH_PA8MFP_Pos )                 /*!< SYS_T::GPA_MFPH: PA8MFP Mask           */

