FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/sys_reg.h
#define SYS_GPD_MFPH_PD10MFP_Pos      ( 8 )                                                /*!< SYS_T::GPD_MFPH: PD10MFP Position      */
#define SYS_GPD_MFPH_PD10MFP_Msk      ( 0xful << SYS_GPD_MFPH_PD10MFP_Pos )                /*!< SYS_T::GPD_MFPH: PD10MFP Mask          */

#define SYS_GPD_MFPH_PD11MFP_Pos      ( 12 )                                               /*!< SYS_T::GPD_MFPH: PD11MFP Position      */
#define SYS_GPD_MFPH_PD11MFP_Msk      ( 0xful << SYS_GPD_MFPH_PD11MFP_Pos )                /*!< SYS_T::GPD_MFPH: PD11MFP Mask          */

#define SYS_GPD_MFPH_PD12MFP_Pos      ( 16 )                                               /*!< SYS_T::GPD_MFPH: PD12MFP Position      */
#define SYS_GPD_MFPH_PD12MFP_Msk      ( 0xful << SYS_GPD_MFPH_PD12MFP_Pos )                /*!< SYS_T::GPD_MFPH: PD12MFP Mask          */

#define SYS_GPD_MFPH_PD13MFP_Pos      ( 20 )                                               /*!< SYS_T::GPD_MFPH: PD13MFP Position      */
#define SYS_GPD_MFPH_PD13MFP_Msk      ( 0xful << SYS_GPD_MFPH_PD13MFP_Pos )                /*!< SYS_T::GPD_MFPH: PD13MFP Mask          */

#define SYS_GPD_MFPH_PD14MFP_Pos      ( 24 )                                               /*!< SYS_T::GPD_MFPH: PD14MFP Position      */
#define SYS_GPD_MFPH_PD14MFP_Msk      ( 0xful << SYS_GPD_MFPH_PD14MFP_Pos )                /*!< SYS_T::GPD_MFPH: PD14MFP Mask          */

#define SYS_GPE_MFPL_PE0MFP_Pos       ( 0 )                                                /*!< SYS_T::GPE_MFPL: PE0MFP Position       */
#define SYS_GPE_MFPL_PE0MFP_Msk       ( 0xful << SYS_GPE_MFPL_PE0MFP_Pos )                 /*!< SYS_T::GPE_MFPL: PE0MFP Mask           */

#define SYS_GPE_MFPL_PE1MFP_Pos       ( 4 )                                                /*!< SYS_T::GPE_MFPL: PE1MFP Position       */
#define SYS_GPE_MFPL_PE1MFP_Msk       ( 0xful << SYS_GPE_MFPL_PE1MFP_Pos )                 /*!< SYS_T::GPE_MFPL: PE1MFP Mask           */

#define SYS_GPE_MFPL_PE2MFP_Pos       ( 8 )                                                /*!< SYS_T::GPE_MFPL: PE2MFP Position       */
#define SYS_GPE_MFPL_PE2MFP_Msk       ( 0xful << SYS_GPE_MFPL_PE2MFP_Pos )                 /*!< SYS_T::GPE_MFPL: PE2MFP Mask           */

#define SYS_GPE_MFPL_PE3MFP_Pos       ( 12 )                                               /*!< SYS_T::GPE_MFPL: PE3MFP Position       */
#define SYS_GPE_MFPL_PE3MFP_Msk       ( 0xful << SYS_GPE_MFPL_PE3MFP_Pos )                 /*!< SYS_T::GPE_MFPL: PE3MFP Mask           */

#define SYS_GPE_MFPL_PE4MFP_Pos       ( 16 )                                               /*!< SYS_T::GPE_MFPL: PE4MFP Position       */
#define SYS_GPE_MFPL_PE4MFP_Msk       ( 0xful << SYS_GPE_MFPL_PE4MFP_Pos )                 /*!< SYS_T::GPE_MFPL: PE4MFP Mask           */

#define SYS_GPE_MFPL_PE5MFP_Pos       ( 20 )                                               /*!< SYS_T::GPE_MFPL: PE5MFP Position       */
#define SYS_GPE_MFPL_PE5MFP_Msk       ( 0xful << SYS_GPE_MFPL_PE5MFP_Pos )                 /*!< SYS_T::GPE_MFPL: PE5MFP Mask           */

#define SYS_GPE_MFPL_PE6MFP_Pos       ( 24 )                                               /*!< SYS_T::GPE_MFPL: PE6MFP Position       */
#define SYS_GPE_MFPL_PE6MFP_Msk       ( 0xful << SYS_GPE_MFPL_PE6MFP_Pos )                 /*!< SYS_T::GPE_MFPL: PE6MFP Mask           */

#define SYS_GPE_MFPL_PE7MFP_Pos       ( 28 )                                               /*!< SYS_T::GPE_MFPL: PE7MFP Position       */
#define SYS_GPE_MFPL_PE7MFP_Msk       ( 0xful << SYS_GPE_MFPL_PE7MFP_Pos )                 /*!< SYS_T::GPE_MFPL: PE7MFP Mask           */

#define SYS_GPE_MFPH_PE8MFP_Pos       ( 0 )                                                /*!< SYS_T::GPE_MFPH: PE8MFP Position       */
#define SYS_GPE_MFPH_PE8MFP_Msk       ( 0xful << SYS_GPE_MFPH_PE8MFP_Pos )                 /*!< SYS_T::GPE_MFPH: PE8MFP Mask           */

#define SYS_GPE_MFPH_PE9MFP_Pos       ( 4 )                                                /*!< SYS_T::GPE_MFPH: PE9MFP Position       */
#define SYS_GPE_MFPH_PE9MFP_Msk       ( 0xful << SYS_GPE_MFPH_PE9MFP_Pos )                 /*!< SYS_T::GPE_MFPH: PE9MFP Mask           */

#define SYS_GPE_MFPH_PE10MFP_Pos      ( 8 )                                                /*!< SYS_T::GPE_MFPH: PE10MFP Position      */
#define SYS_GPE_MFPH_PE10MFP_Msk      ( 0xful << SYS_GPE_MFPH_PE10MFP_Pos )                /*!< SYS_T::GPE_MFPH: PE10MFP Mask          */

#define SYS_GPE_MFPH_PE11MFP_Pos      ( 12 )                                               /*!< SYS_T::GPE_MFPH: PE11MFP Position      */
#define SYS_GPE_MFPH_PE11MFP_Msk      ( 0xful << SYS_GPE_MFPH_PE11MFP_Pos )                /*!< SYS_T::GPE_MFPH: PE11MFP Mask          */

#define SYS_GPE_MFPH_PE12MFP_Pos      ( 16 )                                               /*!< SYS_T::GPE_MFPH: PE12MFP Position      */
#define SYS_GPE_MFPH_PE12MFP_Msk      ( 0xful << SYS_GPE_MFPH_PE12MFP_Pos )                /*!< SYS_T::GPE_MFPH: PE12MFP Mask          */

#define SYS_GPE_MFPH_PE13MFP_Pos      ( 20 )                                               /*!< SYS_T::GPE_MFPH: PE13MFP Position      */
#define SYS_GPE_MFPH_PE13MFP_Msk      ( 0xful << SYS_GPE_MFPH_PE13MFP_Pos )                /*!< SYS_T::GPE_MFPH: PE13MFP Mask          */

#define SYS_GPE_MFPH_PE14MFP_Pos      ( 24 )                                               /*!< SYS_T::GPE_MFPH: PE14MFP Position      */
#define SYS_GPE_MFPH_PE14MFP_Msk      ( 0xful << SYS_GPE_MFPH_PE14MFP_Pos )                /*!< SYS_T::GPE_MFPH: PE14MFP Mask          */

#define SYS_GPE_MFPH_PE15MFP_Pos      ( 28 )                                               /*!< SYS_T::GPE_MFPH: PE15MFP Position      */
#define SYS_GPE_MFPH_PE15MFP_Msk      ( 0xful << SYS_GPE_MFPH_PE15MFP_Pos )                /*!< SYS_T::GPE_MFPH: PE15MFP Mask          */

#define SYS_GPF_MFPL_PF0MFP_Pos       ( 0 )                                                /*!< SYS_T::GPF_MFPL: PF0MFP Position       */
#define SYS_GPF_MFPL_PF0MFP_Msk       ( 0xful << SYS_GPF_MFPL_PF0MFP_Pos )                 /*!< SYS_T::GPF_MFPL: PF0MFP Mask           */

#define SYS_GPF_MFPL_PF1MFP_Pos       ( 4 )                                                /*!< SYS_T::GPF_MFPL: PF1MFP Position       */
#define SYS_GPF_MFPL_PF1MFP_Msk       ( 0xful << SYS_GPF_MFPL_PF1MFP_Pos )                 /*!< SYS_T::GPF_MFPL: PF1MFP Mask           */

#define SYS_GPF_MFPL_PF2MFP_Pos       ( 8 )                                                /*!< SYS_T::GPF_MFPL: PF2MFP Position       */
#define SYS_GPF_MFPL_PF2MFP_Msk       ( 0xful << SYS_GPF_MFPL_PF2MFP_Pos )                 /*!< SYS_T::GPF_MFPL: PF2MFP Mask           */

