FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/sys_reg.h
#define SYS_GPF_MFPL_PF3MFP_Pos       ( 12 )                                               /*!< SYS_T::GPF_MFPL: PF3MFP Position       */
#define SYS_GPF_MFPL_PF3MFP_Msk       ( 0xful << SYS_GPF_MFPL_PF3MFP_Pos )                 /*!< SYS_T::GPF_MFPL: PF3MFP Mask           */

#define SYS_GPF_MFPL_PF4MFP_Pos       ( 16 )                                               /*!< SYS_T::GPF_MFPL: PF4MFP Position       */
#define SYS_GPF_MFPL_PF4MFP_Msk       ( 0xful << SYS_GPF_MFPL_PF4MFP_Pos )                 /*!< SYS_T::GPF_MFPL: PF4MFP Mask           */

#define SYS_GPF_MFPL_PF5MFP_Pos       ( 20 )                                               /*!< SYS_T::GPF_MFPL: PF5MFP Position       */
#define SYS_GPF_MFPL_PF5MFP_Msk       ( 0xful << SYS_GPF_MFPL_PF5MFP_Pos )                 /*!< SYS_T::GPF_MFPL: PF5MFP Mask           */

#define SYS_GPF_MFPL_PF6MFP_Pos       ( 24 )                                               /*!< SYS_T::GPF_MFPL: PF6MFP Position       */
#define SYS_GPF_MFPL_PF6MFP_Msk       ( 0xful << SYS_GPF_MFPL_PF6MFP_Pos )                 /*!< SYS_T::GPF_MFPL: PF6MFP Mask           */

#define SYS_GPF_MFPL_PF7MFP_Pos       ( 28 )                                               /*!< SYS_T::GPF_MFPL: PF7MFP Position       */
#define SYS_GPF_MFPL_PF7MFP_Msk       ( 0xful << SYS_GPF_MFPL_PF7MFP_Pos )                 /*!< SYS_T::GPF_MFPL: PF7MFP Mask           */

#define SYS_GPF_MFPH_PF8MFP_Pos       ( 0 )                                                /*!< SYS_T::GPF_MFPH: PF8MFP Position       */
#define SYS_GPF_MFPH_PF8MFP_Msk       ( 0xful << SYS_GPF_MFPH_PF8MFP_Pos )                 /*!< SYS_T::GPF_MFPH: PF8MFP Mask           */

#define SYS_GPF_MFPH_PF9MFP_Pos       ( 4 )                                                /*!< SYS_T::GPF_MFPH: PF9MFP Position       */
#define SYS_GPF_MFPH_PF9MFP_Msk       ( 0xful << SYS_GPF_MFPH_PF9MFP_Pos )                 /*!< SYS_T::GPF_MFPH: PF9MFP Mask           */

#define SYS_GPF_MFPH_PF10MFP_Pos      ( 8 )                                                /*!< SYS_T::GPF_MFPH: PF10MFP Position      */
#define SYS_GPF_MFPH_PF10MFP_Msk      ( 0xful << SYS_GPF_MFPH_PF10MFP_Pos )                /*!< SYS_T::GPF_MFPH: PF10MFP Mask          */

#define SYS_GPF_MFPH_PF11MFP_Pos      ( 12 )                                               /*!< SYS_T::GPF_MFPH: PF11MFP Position      */
#define SYS_GPF_MFPH_PF11MFP_Msk      ( 0xful << SYS_GPF_MFPH_PF11MFP_Pos )                /*!< SYS_T::GPF_MFPH: PF11MFP Mask          */

#define SYS_GPG_MFPL_PG2MFP_Pos       ( 8 )                                                /*!< SYS_T::GPG_MFPL: PG2MFP Position       */
#define SYS_GPG_MFPL_PG2MFP_Msk       ( 0xful << SYS_GPG_MFPL_PG2MFP_Pos )                 /*!< SYS_T::GPG_MFPL: PG2MFP Mask           */

#define SYS_GPG_MFPL_PG3MFP_Pos       ( 12 )                                               /*!< SYS_T::GPG_MFPL: PG3MFP Position       */
#define SYS_GPG_MFPL_PG3MFP_Msk       ( 0xful << SYS_GPG_MFPL_PG3MFP_Pos )                 /*!< SYS_T::GPG_MFPL: PG3MFP Mask           */

#define SYS_GPG_MFPL_PG4MFP_Pos       ( 16 )                                               /*!< SYS_T::GPG_MFPL: PG4MFP Position       */
#define SYS_GPG_MFPL_PG4MFP_Msk       ( 0xful << SYS_GPG_MFPL_PG4MFP_Pos )                 /*!< SYS_T::GPG_MFPL: PG4MFP Mask           */

#define SYS_GPG_MFPH_PG9MFP_Pos       ( 4 )                                                /*!< SYS_T::GPG_MFPH: PG9MFP Position       */
#define SYS_GPG_MFPH_PG9MFP_Msk       ( 0xful << SYS_GPG_MFPH_PG9MFP_Pos )                 /*!< SYS_T::GPG_MFPH: PG9MFP Mask           */

#define SYS_GPG_MFPH_PG10MFP_Pos      ( 8 )                                                /*!< SYS_T::GPG_MFPH: PG10MFP Position      */
#define SYS_GPG_MFPH_PG10MFP_Msk      ( 0xful << SYS_GPG_MFPH_PG10MFP_Pos )                /*!< SYS_T::GPG_MFPH: PG10MFP Mask          */

#define SYS_GPG_MFPH_PG11MFP_Pos      ( 12 )                                               /*!< SYS_T::GPG_MFPH: PG11MFP Position      */
#define SYS_GPG_MFPH_PG11MFP_Msk      ( 0xful << SYS_GPG_MFPH_PG11MFP_Pos )                /*!< SYS_T::GPG_MFPH: PG11MFP Mask          */

#define SYS_GPG_MFPH_PG12MFP_Pos      ( 16 )                                               /*!< SYS_T::GPG_MFPH: PG12MFP Position      */
#define SYS_GPG_MFPH_PG12MFP_Msk      ( 0xful << SYS_GPG_MFPH_PG12MFP_Pos )                /*!< SYS_T::GPG_MFPH: PG12MFP Mask          */

#define SYS_GPG_MFPH_PG13MFP_Pos      ( 20 )                                               /*!< SYS_T::GPG_MFPH: PG13MFP Position      */
#define SYS_GPG_MFPH_PG13MFP_Msk      ( 0xful << SYS_GPG_MFPH_PG13MFP_Pos )                /*!< SYS_T::GPG_MFPH: PG13MFP Mask          */

#define SYS_GPG_MFPH_PG14MFP_Pos      ( 24 )                                               /*!< SYS_T::GPG_MFPH: PG14MFP Position      */
#define SYS_GPG_MFPH_PG14MFP_Msk      ( 0xful << SYS_GPG_MFPH_PG14MFP_Pos )                /*!< SYS_T::GPG_MFPH: PG14MFP Mask          */

#define SYS_GPG_MFPH_PG15MFP_Pos      ( 28 )                                               /*!< SYS_T::GPG_MFPH: PG15MFP Position      */
#define SYS_GPG_MFPH_PG15MFP_Msk      ( 0xful << SYS_GPG_MFPH_PG15MFP_Pos )                /*!< SYS_T::GPG_MFPH: PG15MFP Mask          */

#define SYS_GPH_MFPL_PH4MFP_Pos       ( 16 )                                               /*!< SYS_T::GPH_MFPL: PH4MFP Position       */
#define SYS_GPH_MFPL_PH4MFP_Msk       ( 0xful << SYS_GPH_MFPL_PH4MFP_Pos )                 /*!< SYS_T::GPH_MFPL: PH4MFP Mask           */

#define SYS_GPH_MFPL_PH5MFP_Pos       ( 20 )                                               /*!< SYS_T::GPH_MFPL: PH5MFP Position       */
#define SYS_GPH_MFPL_PH5MFP_Msk       ( 0xful << SYS_GPH_MFPL_PH5MFP_Pos )                 /*!< SYS_T::GPH_MFPL: PH5MFP Mask           */

#define SYS_GPH_MFPL_PH6MFP_Pos       ( 24 )                                               /*!< SYS_T::GPH_MFPL: PH6MFP Position       */
#define SYS_GPH_MFPL_PH6MFP_Msk       ( 0xful << SYS_GPH_MFPL_PH6MFP_Pos )                 /*!< SYS_T::GPH_MFPL: PH6MFP Mask           */

#define SYS_GPH_MFPL_PH7MFP_Pos       ( 28 )                                               /*!< SYS_T::GPH_MFPL: PH7MFP Position       */
#define SYS_GPH_MFPL_PH7MFP_Msk       ( 0xful << SYS_GPH_MFPL_PH7MFP_Pos )                 /*!< SYS_T::GPH_MFPL: PH7MFP Mask           */

#define SYS_GPH_MFPH_PH8MFP_Pos       ( 0 )                                                /*!< SYS_T::GPH_MFPH: PH8MFP Position       */
#define SYS_GPH_MFPH_PH8MFP_Msk       ( 0xful << SYS_GPH_MFPH_PH8MFP_Pos )                 /*!< SYS_T::GPH_MFPH: PH8MFP Mask           */

#define SYS_GPH_MFPH_PH9MFP_Pos       ( 4 )                                                /*!< SYS_T::GPH_MFPH: PH9MFP Position       */
#define SYS_GPH_MFPH_PH9MFP_Msk       ( 0xful << SYS_GPH_MFPH_PH9MFP_Pos )                 /*!< SYS_T::GPH_MFPH: PH9MFP Mask           */

#define SYS_GPH_MFPH_PH10MFP_Pos      ( 8 )                                                /*!< SYS_T::GPH_MFPH: PH10MFP Position      */
#define SYS_GPH_MFPH_PH10MFP_Msk      ( 0xful << SYS_GPH_MFPH_PH10MFP_Pos )                /*!< SYS_T::GPH_MFPH: PH10MFP Mask          */

