FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/sys_reg.h
#define SYS_GPB_MFOS_MFOS10_Pos       ( 10 )                                               /*!< SYS_T::GPB_MFOS: MFOS10 Position       */
#define SYS_GPB_MFOS_MFOS10_Msk       ( 0x1ul << SYS_GPB_MFOS_MFOS10_Pos )                 /*!< SYS_T::GPB_MFOS: MFOS10 Mask           */

#define SYS_GPB_MFOS_MFOS11_Pos       ( 11 )                                               /*!< SYS_T::GPB_MFOS: MFOS11 Position       */
#define SYS_GPB_MFOS_MFOS11_Msk       ( 0x1ul << SYS_GPB_MFOS_MFOS11_Pos )                 /*!< SYS_T::GPB_MFOS: MFOS11 Mask           */

#define SYS_GPB_MFOS_MFOS12_Pos       ( 12 )                                               /*!< SYS_T::GPB_MFOS: MFOS12 Position       */
#define SYS_GPB_MFOS_MFOS12_Msk       ( 0x1ul << SYS_GPB_MFOS_MFOS12_Pos )                 /*!< SYS_T::GPB_MFOS: MFOS12 Mask           */

#define SYS_GPB_MFOS_MFOS13_Pos       ( 13 )                                               /*!< SYS_T::GPB_MFOS: MFOS13 Position       */
#define SYS_GPB_MFOS_MFOS13_Msk       ( 0x1ul << SYS_GPB_MFOS_MFOS13_Pos )                 /*!< SYS_T::GPB_MFOS: MFOS13 Mask           */

#define SYS_GPB_MFOS_MFOS14_Pos       ( 14 )                                               /*!< SYS_T::GPB_MFOS: MFOS14 Position       */
#define SYS_GPB_MFOS_MFOS14_Msk       ( 0x1ul << SYS_GPB_MFOS_MFOS14_Pos )                 /*!< SYS_T::GPB_MFOS: MFOS14 Mask           */

#define SYS_GPB_MFOS_MFOS15_Pos       ( 15 )                                               /*!< SYS_T::GPB_MFOS: MFOS15 Position       */
#define SYS_GPB_MFOS_MFOS15_Msk       ( 0x1ul << SYS_GPB_MFOS_MFOS15_Pos )                 /*!< SYS_T::GPB_MFOS: MFOS15 Mask           */

#define SYS_GPC_MFOS_MFOS0_Pos        ( 0 )                                                /*!< SYS_T::GPC_MFOS: MFOS0 Position        */
#define SYS_GPC_MFOS_MFOS0_Msk        ( 0x1ul << SYS_GPC_MFOS_MFOS0_Pos )                  /*!< SYS_T::GPC_MFOS: MFOS0 Mask            */

#define SYS_GPC_MFOS_MFOS1_Pos        ( 1 )                                                /*!< SYS_T::GPC_MFOS: MFOS1 Position        */
#define SYS_GPC_MFOS_MFOS1_Msk        ( 0x1ul << SYS_GPC_MFOS_MFOS1_Pos )                  /*!< SYS_T::GPC_MFOS: MFOS1 Mask            */

#define SYS_GPC_MFOS_MFOS2_Pos        ( 2 )                                                /*!< SYS_T::GPC_MFOS: MFOS2 Position        */
#define SYS_GPC_MFOS_MFOS2_Msk        ( 0x1ul << SYS_GPC_MFOS_MFOS2_Pos )                  /*!< SYS_T::GPC_MFOS: MFOS2 Mask            */

#define SYS_GPC_MFOS_MFOS3_Pos        ( 3 )                                                /*!< SYS_T::GPC_MFOS: MFOS3 Position        */
#define SYS_GPC_MFOS_MFOS3_Msk        ( 0x1ul << SYS_GPC_MFOS_MFOS3_Pos )                  /*!< SYS_T::GPC_MFOS: MFOS3 Mask            */

#define SYS_GPC_MFOS_MFOS4_Pos        ( 4 )                                                /*!< SYS_T::GPC_MFOS: MFOS4 Position        */
#define SYS_GPC_MFOS_MFOS4_Msk        ( 0x1ul << SYS_GPC_MFOS_MFOS4_Pos )                  /*!< SYS_T::GPC_MFOS: MFOS4 Mask            */

#define SYS_GPC_MFOS_MFOS5_Pos        ( 5 )                                                /*!< SYS_T::GPC_MFOS: MFOS5 Position        */
#define SYS_GPC_MFOS_MFOS5_Msk        ( 0x1ul << SYS_GPC_MFOS_MFOS5_Pos )                  /*!< SYS_T::GPC_MFOS: MFOS5 Mask            */

#define SYS_GPC_MFOS_MFOS6_Pos        ( 6 )                                                /*!< SYS_T::GPC_MFOS: MFOS6 Position        */
#define SYS_GPC_MFOS_MFOS6_Msk        ( 0x1ul << SYS_GPC_MFOS_MFOS6_Pos )                  /*!< SYS_T::GPC_MFOS: MFOS6 Mask            */

#define SYS_GPC_MFOS_MFOS7_Pos        ( 7 )                                                /*!< SYS_T::GPC_MFOS: MFOS7 Position        */
#define SYS_GPC_MFOS_MFOS7_Msk        ( 0x1ul << SYS_GPC_MFOS_MFOS7_Pos )                  /*!< SYS_T::GPC_MFOS: MFOS7 Mask            */

#define SYS_GPC_MFOS_MFOS8_Pos        ( 8 )                                                /*!< SYS_T::GPC_MFOS: MFOS8 Position        */
#define SYS_GPC_MFOS_MFOS8_Msk        ( 0x1ul << SYS_GPC_MFOS_MFOS8_Pos )                  /*!< SYS_T::GPC_MFOS: MFOS8 Mask            */

#define SYS_GPC_MFOS_MFOS9_Pos        ( 9 )                                                /*!< SYS_T::GPC_MFOS: MFOS9 Position        */
#define SYS_GPC_MFOS_MFOS9_Msk        ( 0x1ul << SYS_GPC_MFOS_MFOS9_Pos )                  /*!< SYS_T::GPC_MFOS: MFOS9 Mask            */

#define SYS_GPC_MFOS_MFOS10_Pos       ( 10 )                                               /*!< SYS_T::GPC_MFOS: MFOS10 Position       */
#define SYS_GPC_MFOS_MFOS10_Msk       ( 0x1ul << SYS_GPC_MFOS_MFOS10_Pos )                 /*!< SYS_T::GPC_MFOS: MFOS10 Mask           */

#define SYS_GPC_MFOS_MFOS11_Pos       ( 11 )                                               /*!< SYS_T::GPC_MFOS: MFOS11 Position       */
#define SYS_GPC_MFOS_MFOS11_Msk       ( 0x1ul << SYS_GPC_MFOS_MFOS11_Pos )                 /*!< SYS_T::GPC_MFOS: MFOS11 Mask           */

#define SYS_GPC_MFOS_MFOS12_Pos       ( 12 )                                               /*!< SYS_T::GPC_MFOS: MFOS12 Position       */
#define SYS_GPC_MFOS_MFOS12_Msk       ( 0x1ul << SYS_GPC_MFOS_MFOS12_Pos )                 /*!< SYS_T::GPC_MFOS: MFOS12 Mask           */

#define SYS_GPC_MFOS_MFOS13_Pos       ( 13 )                                               /*!< SYS_T::GPC_MFOS: MFOS13 Position       */
#define SYS_GPC_MFOS_MFOS13_Msk       ( 0x1ul << SYS_GPC_MFOS_MFOS13_Pos )                 /*!< SYS_T::GPC_MFOS: MFOS13 Mask           */

#define SYS_GPD_MFOS_MFOS0_Pos        ( 0 )                                                /*!< SYS_T::GPD_MFOS: MFOS0 Position        */
#define SYS_GPD_MFOS_MFOS0_Msk        ( 0x1ul << SYS_GPD_MFOS_MFOS0_Pos )                  /*!< SYS_T::GPD_MFOS: MFOS0 Mask            */

#define SYS_GPD_MFOS_MFOS1_Pos        ( 1 )                                                /*!< SYS_T::GPD_MFOS: MFOS1 Position        */
#define SYS_GPD_MFOS_MFOS1_Msk        ( 0x1ul << SYS_GPD_MFOS_MFOS1_Pos )                  /*!< SYS_T::GPD_MFOS: MFOS1 Mask            */

#define SYS_GPD_MFOS_MFOS2_Pos        ( 2 )                                                /*!< SYS_T::GPD_MFOS: MFOS2 Position        */
#define SYS_GPD_MFOS_MFOS2_Msk        ( 0x1ul << SYS_GPD_MFOS_MFOS2_Pos )                  /*!< SYS_T::GPD_MFOS: MFOS2 Mask            */

#define SYS_GPD_MFOS_MFOS3_Pos        ( 3 )                                                /*!< SYS_T::GPD_MFOS: MFOS3 Position        */
#define SYS_GPD_MFOS_MFOS3_Msk        ( 0x1ul << SYS_GPD_MFOS_MFOS3_Pos )                  /*!< SYS_T::GPD_MFOS: MFOS3 Mask            */

#define SYS_GPD_MFOS_MFOS4_Pos        ( 4 )                                                /*!< SYS_T::GPD_MFOS: MFOS4 Position        */
#define SYS_GPD_MFOS_MFOS4_Msk        ( 0x1ul << SYS_GPD_MFOS_MFOS4_Pos )                  /*!< SYS_T::GPD_MFOS: MFOS4 Mask            */

#define SYS_GPD_MFOS_MFOS5_Pos        ( 5 )                                                /*!< SYS_T::GPD_MFOS: MFOS5 Position        */
#define SYS_GPD_MFOS_MFOS5_Msk        ( 0x1ul << SYS_GPD_MFOS_MFOS5_Pos )                  /*!< SYS_T::GPD_MFOS: MFOS5 Mask            */

#define SYS_GPD_MFOS_MFOS6_Pos        ( 6 )                                                /*!< SYS_T::GPD_MFOS: MFOS6 Position        */
#define SYS_GPD_MFOS_MFOS6_Msk        ( 0x1ul << SYS_GPD_MFOS_MFOS6_Pos )                  /*!< SYS_T::GPD_MFOS: MFOS6 Mask            */

#define SYS_GPD_MFOS_MFOS7_Pos        ( 7 )                                                /*!< SYS_T::GPD_MFOS: MFOS7 Position        */
#define SYS_GPD_MFOS_MFOS7_Msk        ( 0x1ul << SYS_GPD_MFOS_MFOS7_Pos )                  /*!< SYS_T::GPD_MFOS: MFOS7 Mask            */

