FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/sys_reg.h
#define SYS_GPG_MFOS_MFOS10_Pos       ( 10 )                                               /*!< SYS_T::GPG_MFOS: MFOS10 Position       */
#define SYS_GPG_MFOS_MFOS10_Msk       ( 0x1ul << SYS_GPG_MFOS_MFOS10_Pos )                 /*!< SYS_T::GPG_MFOS: MFOS10 Mask           */

#define SYS_GPG_MFOS_MFOS11_Pos       ( 11 )                                               /*!< SYS_T::GPG_MFOS: MFOS11 Position       */
#define SYS_GPG_MFOS_MFOS11_Msk       ( 0x1ul << SYS_GPG_MFOS_MFOS11_Pos )                 /*!< SYS_T::GPG_MFOS: MFOS11 Mask           */

#define SYS_GPG_MFOS_MFOS12_Pos       ( 12 )                                               /*!< SYS_T::GPG_MFOS: MFOS12 Position       */
#define SYS_GPG_MFOS_MFOS12_Msk       ( 0x1ul << SYS_GPG_MFOS_MFOS12_Pos )                 /*!< SYS_T::GPG_MFOS: MFOS12 Mask           */

#define SYS_GPG_MFOS_MFOS13_Pos       ( 13 )                                               /*!< SYS_T::GPG_MFOS: MFOS13 Position       */
#define SYS_GPG_MFOS_MFOS13_Msk       ( 0x1ul << SYS_GPG_MFOS_MFOS13_Pos )                 /*!< SYS_T::GPG_MFOS: MFOS13 Mask           */

#define SYS_GPG_MFOS_MFOS14_Pos       ( 14 )                                               /*!< SYS_T::GPG_MFOS: MFOS14 Position       */
#define SYS_GPG_MFOS_MFOS14_Msk       ( 0x1ul << SYS_GPG_MFOS_MFOS14_Pos )                 /*!< SYS_T::GPG_MFOS: MFOS14 Mask           */

#define SYS_GPG_MFOS_MFOS15_Pos       ( 15 )                                               /*!< SYS_T::GPG_MFOS: MFOS15 Position       */
#define SYS_GPG_MFOS_MFOS15_Msk       ( 0x1ul << SYS_GPG_MFOS_MFOS15_Pos )                 /*!< SYS_T::GPG_MFOS: MFOS15 Mask           */

#define SYS_GPH_MFOS_MFOS4_Pos        ( 4 )                                                /*!< SYS_T::GPH_MFOS: MFOS4 Position        */
#define SYS_GPH_MFOS_MFOS4_Msk        ( 0x1ul << SYS_GPH_MFOS_MFOS4_Pos )                  /*!< SYS_T::GPH_MFOS: MFOS4 Mask            */

#define SYS_GPH_MFOS_MFOS5_Pos        ( 5 )                                                /*!< SYS_T::GPH_MFOS: MFOS5 Position        */
#define SYS_GPH_MFOS_MFOS5_Msk        ( 0x1ul << SYS_GPH_MFOS_MFOS5_Pos )                  /*!< SYS_T::GPH_MFOS: MFOS5 Mask            */

#define SYS_GPH_MFOS_MFOS6_Pos        ( 6 )                                                /*!< SYS_T::GPH_MFOS: MFOS6 Position        */
#define SYS_GPH_MFOS_MFOS6_Msk        ( 0x1ul << SYS_GPH_MFOS_MFOS6_Pos )                  /*!< SYS_T::GPH_MFOS: MFOS6 Mask            */

#define SYS_GPH_MFOS_MFOS7_Pos        ( 7 )                                                /*!< SYS_T::GPH_MFOS: MFOS7 Position        */
#define SYS_GPH_MFOS_MFOS7_Msk        ( 0x1ul << SYS_GPH_MFOS_MFOS7_Pos )                  /*!< SYS_T::GPH_MFOS: MFOS7 Mask            */

#define SYS_GPH_MFOS_MFOS8_Pos        ( 8 )                                                /*!< SYS_T::GPH_MFOS: MFOS8 Position        */
#define SYS_GPH_MFOS_MFOS8_Msk        ( 0x1ul << SYS_GPH_MFOS_MFOS8_Pos )                  /*!< SYS_T::GPH_MFOS: MFOS8 Mask            */

#define SYS_GPH_MFOS_MFOS9_Pos        ( 9 )                                                /*!< SYS_T::GPH_MFOS: MFOS9 Position        */
#define SYS_GPH_MFOS_MFOS9_Msk        ( 0x1ul << SYS_GPH_MFOS_MFOS9_Pos )                  /*!< SYS_T::GPH_MFOS: MFOS9 Mask            */

#define SYS_GPH_MFOS_MFOS10_Pos       ( 10 )                                               /*!< SYS_T::GPH_MFOS: MFOS10 Position       */
#define SYS_GPH_MFOS_MFOS10_Msk       ( 0x1ul << SYS_GPH_MFOS_MFOS10_Pos )                 /*!< SYS_T::GPH_MFOS: MFOS10 Mask           */

#define SYS_GPH_MFOS_MFOS11_Pos       ( 11 )                                               /*!< SYS_T::GPH_MFOS: MFOS11 Position       */
#define SYS_GPH_MFOS_MFOS11_Msk       ( 0x1ul << SYS_GPH_MFOS_MFOS11_Pos )                 /*!< SYS_T::GPH_MFOS: MFOS11 Mask           */

#define SYS_SRAMICTL_PERRIEN_Pos      ( 0 )                                                /*!< SYS_T::SRAMICTL: PERRIEN Position      */
#define SYS_SRAMICTL_PERRIEN_Msk      ( 0x1ul << SYS_SRAMICTL_PERRIEN_Pos )                /*!< SYS_T::SRAMICTL: PERRIEN Mask          */

#define SYS_SRAMSTS_PERRIF_Pos        ( 0 )                                                /*!< SYS_T::SRAMSTS: PERRIF Position        */
#define SYS_SRAMSTS_PERRIF_Msk        ( 0x1ul << SYS_SRAMSTS_PERRIF_Pos )                  /*!< SYS_T::SRAMSTS: PERRIF Mask            */

#define SYS_SRAMEADR_ERRADDR_Pos      ( 0 )                                                /*!< SYS_T::SRAMEADR: ERRADDR Position      */
#define SYS_SRAMEADR_ERRADDR_Msk      ( 0xfffffffful << SYS_SRAMEADR_ERRADDR_Pos )         /*!< SYS_T::SRAMEADR: ERRADDR Mask          */

#define SYS_SRAMPCTL_STACK_Pos        ( 0 )                                                /*!< SYS_T::SRAMPCTL: STACK Position        */
#define SYS_SRAMPCTL_STACK_Msk        ( 0xful << SYS_SRAMPCTL_STACK_Pos )                  /*!< SYS_T::SRAMPCTL: STACK Mask            */

#define SYS_SRAMPCTL_RETCNT_Pos       ( 4 )                                                /*!< SYS_T::SRAMPCTL: RETCNT Position       */
#define SYS_SRAMPCTL_RETCNT_Msk       ( 0x3ul << SYS_SRAMPCTL_RETCNT_Pos )                 /*!< SYS_T::SRAMPCTL: RETCNT Mask           */

#define SYS_SRAMPCTL_SRAM0PM0_Pos     ( 8 )                                                /*!< SYS_T::SRAMPCTL: SRAM0PM0 Position     */
#define SYS_SRAMPCTL_SRAM0PM0_Msk     ( 0x3ul << SYS_SRAMPCTL_SRAM0PM0_Pos )               /*!< SYS_T::SRAMPCTL: SRAM0PM0 Mask         */

#define SYS_SRAMPCTL_SRAM0PM1_Pos     ( 10 )                                               /*!< SYS_T::SRAMPCTL: SRAM0PM1 Position     */
#define SYS_SRAMPCTL_SRAM0PM1_Msk     ( 0x3ul << SYS_SRAMPCTL_SRAM0PM1_Pos )               /*!< SYS_T::SRAMPCTL: SRAM0PM1 Mask         */

#define SYS_SRAMPCTL_SRAM0PM2_Pos     ( 12 )                                               /*!< SYS_T::SRAMPCTL: SRAM0PM2 Position     */
#define SYS_SRAMPCTL_SRAM0PM2_Msk     ( 0x3ul << SYS_SRAMPCTL_SRAM0PM2_Pos )               /*!< SYS_T::SRAMPCTL: SRAM0PM2 Mask         */

