FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/sys_reg.h
#define SYS_SRAMPCTL_SRAM0PM3_Pos     ( 14 )                                               /*!< SYS_T::SRAMPCTL: SRAM0PM3 Position     */
#define SYS_SRAMPCTL_SRAM0PM3_Msk     ( 0x3ul << SYS_SRAMPCTL_SRAM0PM3_Pos )               /*!< SYS_T::SRAMPCTL: SRAM0PM3 Mask         */

#define SYS_SRAMPCTL_SRAM1PM0_Pos     ( 16 )                                               /*!< SYS_T::SRAMPCTL: SRAM1PM0 Position     */
#define SYS_SRAMPCTL_SRAM1PM0_Msk     ( 0x3ul << SYS_SRAMPCTL_SRAM1PM0_Pos )               /*!< SYS_T::SRAMPCTL: SRAM1PM0 Mask         */

#define SYS_SRAMPCTL_SRAM1PM1_Pos     ( 18 )                                               /*!< SYS_T::SRAMPCTL: SRAM1PM1 Position     */
#define SYS_SRAMPCTL_SRAM1PM1_Msk     ( 0x3ul << SYS_SRAMPCTL_SRAM1PM1_Pos )               /*!< SYS_T::SRAMPCTL: SRAM1PM1 Mask         */

#define SYS_SRAMPCTL_SRAM1PM2_Pos     ( 20 )                                               /*!< SYS_T::SRAMPCTL: SRAM1PM2 Position     */
#define SYS_SRAMPCTL_SRAM1PM2_Msk     ( 0x3ul << SYS_SRAMPCTL_SRAM1PM2_Pos )               /*!< SYS_T::SRAMPCTL: SRAM1PM2 Mask         */

#define SYS_SRAMPCTL_SRAM1PM3_Pos     ( 22 )                                               /*!< SYS_T::SRAMPCTL: SRAM1PM3 Position     */
#define SYS_SRAMPCTL_SRAM1PM3_Msk     ( 0x3ul << SYS_SRAMPCTL_SRAM1PM3_Pos )               /*!< SYS_T::SRAMPCTL: SRAM1PM3 Mask         */

#define SYS_SRAMPPCT_CAN_Pos          ( 0 )                                                /*!< SYS_T::SRAMPPCT: CAN Position          */
#define SYS_SRAMPPCT_CAN_Msk          ( 0x3ul << SYS_SRAMPPCT_CAN_Pos )                    /*!< SYS_T::SRAMPPCT: CAN Mask              */

#define SYS_SRAMPPCT_USBD_Pos         ( 2 )                                                /*!< SYS_T::SRAMPPCT: USBD Position         */
#define SYS_SRAMPPCT_USBD_Msk         ( 0x3ul << SYS_SRAMPPCT_USBD_Pos )                   /*!< SYS_T::SRAMPPCT: USBD Mask             */

#define SYS_SRAMPPCT_PDMA0_Pos        ( 4 )                                                /*!< SYS_T::SRAMPPCT: PDMA0 Position        */
#define SYS_SRAMPPCT_PDMA0_Msk        ( 0x3ul << SYS_SRAMPPCT_PDMA0_Pos )                  /*!< SYS_T::SRAMPPCT: PDMA0 Mask            */

#define SYS_SRAMPPCT_PDMA1_Pos        ( 6 )                                                /*!< SYS_T::SRAMPPCT: PDMA1 Position        */
#define SYS_SRAMPPCT_PDMA1_Msk        ( 0x3ul << SYS_SRAMPPCT_PDMA1_Pos )                  /*!< SYS_T::SRAMPPCT: PDMA1 Mask            */

#define SYS_SRAMPPCT_FMC_Pos          ( 8 )                                                /*!< SYS_T::SRAMPPCT: FMC Position          */
#define SYS_SRAMPPCT_FMC_Msk          ( 0x3ul << SYS_SRAMPPCT_FMC_Pos )                    /*!< SYS_T::SRAMPPCT: FMC Mask              */

#define SYS_TCTL48M_FREQSEL_Pos       ( 0 )                                                /*!< SYS_T::TCTL48M: FREQSEL Position       */
#define SYS_TCTL48M_FREQSEL_Msk       ( 0x3ul << SYS_TCTL48M_FREQSEL_Pos )                 /*!< SYS_T::TCTL48M: FREQSEL Mask           */

#define SYS_TCTL48M_LOOPSEL_Pos       ( 4 )                                                /*!< SYS_T::TCTL48M: LOOPSEL Position       */
#define SYS_TCTL48M_LOOPSEL_Msk       ( 0x3ul << SYS_TCTL48M_LOOPSEL_Pos )                 /*!< SYS_T::TCTL48M: LOOPSEL Mask           */

#define SYS_TCTL48M_RETRYCNT_Pos      ( 6 )                                                /*!< SYS_T::TCTL48M: RETRYCNT Position      */
#define SYS_TCTL48M_RETRYCNT_Msk      ( 0x3ul << SYS_TCTL48M_RETRYCNT_Pos )                /*!< SYS_T::TCTL48M: RETRYCNT Mask          */

#define SYS_TCTL48M_CESTOPEN_Pos      ( 8 )                                                /*!< SYS_T::TCTL48M: CESTOPEN Position      */
#define SYS_TCTL48M_CESTOPEN_Msk      ( 0x1ul << SYS_TCTL48M_CESTOPEN_Pos )                /*!< SYS_T::TCTL48M: CESTOPEN Mask          */

#define SYS_TCTL48M_REFCKSEL_Pos      ( 10 )                                               /*!< SYS_T::TCTL48M: REFCKSEL Position      */
#define SYS_TCTL48M_REFCKSEL_Msk      ( 0x1ul << SYS_TCTL48M_REFCKSEL_Pos )                /*!< SYS_T::TCTL48M: REFCKSEL Mask          */

#define SYS_TIEN48M_TFAILIEN_Pos      ( 1 )                                                /*!< SYS_T::TIEN48M: TFAILIEN Position      */
#define SYS_TIEN48M_TFAILIEN_Msk      ( 0x1ul << SYS_TIEN48M_TFAILIEN_Pos )                /*!< SYS_T::TIEN48M: TFAILIEN Mask          */

#define SYS_TIEN48M_CLKEIEN_Pos       ( 2 )                                                /*!< SYS_T::TIEN48M: CLKEIEN Position       */
#define SYS_TIEN48M_CLKEIEN_Msk       ( 0x1ul << SYS_TIEN48M_CLKEIEN_Pos )                 /*!< SYS_T::TIEN48M: CLKEIEN Mask           */

#define SYS_TISTS48M_FREQLOCK_Pos     ( 0 )                                                /*!< SYS_T::TISTS48M: FREQLOCK Position     */
#define SYS_TISTS48M_FREQLOCK_Msk     ( 0x1ul << SYS_TISTS48M_FREQLOCK_Pos )               /*!< SYS_T::TISTS48M: FREQLOCK Mask         */

#define SYS_TISTS48M_TFAILIF_Pos      ( 1 )                                                /*!< SYS_T::TISTS48M: TFAILIF Position      */
#define SYS_TISTS48M_TFAILIF_Msk      ( 0x1ul << SYS_TISTS48M_TFAILIF_Pos )                /*!< SYS_T::TISTS48M: TFAILIF Mask          */

#define SYS_TISTS48M_CLKERRIF_Pos     ( 2 )                                                /*!< SYS_T::TISTS48M: CLKERRIF Position     */
#define SYS_TISTS48M_CLKERRIF_Msk     ( 0x1ul << SYS_TISTS48M_CLKERRIF_Pos )               /*!< SYS_T::TISTS48M: CLKERRIF Mask         */

#define SYS_TCTL12M_FREQSEL_Pos       ( 0 )                                                /*!< SYS_T::TCTL12M: FREQSEL Position       */
#define SYS_TCTL12M_FREQSEL_Msk       ( 0x3ul << SYS_TCTL12M_FREQSEL_Pos )                 /*!< SYS_T::TCTL12M: FREQSEL Mask           */

#define SYS_TCTL12M_LOOPSEL_Pos       ( 4 )                                                /*!< SYS_T::TCTL12M: LOOPSEL Position       */
#define SYS_TCTL12M_LOOPSEL_Msk       ( 0x3ul << SYS_TCTL12M_LOOPSEL_Pos )                 /*!< SYS_T::TCTL12M: LOOPSEL Mask           */

#define SYS_TCTL12M_RETRYCNT_Pos      ( 6 )                                                /*!< SYS_T::TCTL12M: RETRYCNT Position      */
#define SYS_TCTL12M_RETRYCNT_Msk      ( 0x3ul << SYS_TCTL12M_RETRYCNT_Pos )                /*!< SYS_T::TCTL12M: RETRYCNT Mask          */

#define SYS_TCTL12M_CESTOPEN_Pos      ( 8 )                                                /*!< SYS_T::TCTL12M: CESTOPEN Position      */
#define SYS_TCTL12M_CESTOPEN_Msk      ( 0x1ul << SYS_TCTL12M_CESTOPEN_Pos )                /*!< SYS_T::TCTL12M: CESTOPEN Mask          */

