FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/sys_reg.h
#define SYS_NMIEN_BODOUT_Pos        ( 0 )                                                  /*!< SYS_INT_T::NMIEN: BODOUT Position         */
#define SYS_NMIEN_BODOUT_Msk        ( 0x1ul << SYS_NMIEN_BODOUT_Pos )                      /*!< SYS_INT_T::NMIEN: BODOUT Mask             */

#define SYS_NMIEN_IRCINT_Pos        ( 1 )                                                  /*!< SYS_INT_T::NMIEN: IRCINT Position         */
#define SYS_NMIEN_IRCINT_Msk        ( 0x1ul << SYS_NMIEN_IRCINT_Pos )                      /*!< SYS_INT_T::NMIEN: IRCINT Mask             */

#define SYS_NMIEN_PWRWUINT_Pos      ( 2 )                                                  /*!< SYS_INT_T::NMIEN: PWRWUINT Position       */
#define SYS_NMIEN_PWRWUINT_Msk      ( 0x1ul << SYS_NMIEN_PWRWUINT_Pos )                    /*!< SYS_INT_T::NMIEN: PWRWUINT Mask           */

#define SYS_NMIEN_SRAMPERR_Pos      ( 3 )                                                  /*!< SYS_INT_T::NMIEN: SRAMPERR Position       */
#define SYS_NMIEN_SRAMPERR_Msk      ( 0x1ul << SYS_NMIEN_SRAMPERR_Pos )                    /*!< SYS_INT_T::NMIEN: SRAMPERR Mask           */

#define SYS_NMIEN_CLKFAIL_Pos       ( 4 )                                                  /*!< SYS_INT_T::NMIEN: CLKFAIL Position        */
#define SYS_NMIEN_CLKFAIL_Msk       ( 0x1ul << SYS_NMIEN_CLKFAIL_Pos )                     /*!< SYS_INT_T::NMIEN: CLKFAIL Mask            */

#define SYS_NMIEN_RTCINT_Pos        ( 6 )                                                  /*!< SYS_INT_T::NMIEN: RTCINT Position         */
#define SYS_NMIEN_RTCINT_Msk        ( 0x1ul << SYS_NMIEN_RTCINT_Pos )                      /*!< SYS_INT_T::NMIEN: RTCINT Mask             */

#define SYS_NMIEN_TAMPERINT_Pos     ( 7 )                                                  /*!< SYS_INT_T::NMIEN: TAMPERINT Position      */
#define SYS_NMIEN_TAMPERINT_Msk     ( 0x1ul << SYS_NMIEN_TAMPERINT_Pos )                   /*!< SYS_INT_T::NMIEN: TAMPERINT Mask          */

#define SYS_NMIEN_EINT0_Pos         ( 8 )                                                  /*!< SYS_INT_T::NMIEN: EINT0 Position          */
#define SYS_NMIEN_EINT0_Msk         ( 0x1ul << SYS_NMIEN_EINT0_Pos )                       /*!< SYS_INT_T::NMIEN: EINT0 Mask              */

#define SYS_NMIEN_EINT1_Pos         ( 9 )                                                  /*!< SYS_INT_T::NMIEN: EINT1 Position          */
#define SYS_NMIEN_EINT1_Msk         ( 0x1ul << SYS_NMIEN_EINT1_Pos )                       /*!< SYS_INT_T::NMIEN: EINT1 Mask              */

#define SYS_NMIEN_EINT2_Pos         ( 10 )                                                 /*!< SYS_INT_T::NMIEN: EINT2 Position          */
#define SYS_NMIEN_EINT2_Msk         ( 0x1ul << SYS_NMIEN_EINT2_Pos )                       /*!< SYS_INT_T::NMIEN: EINT2 Mask              */

#define SYS_NMIEN_EINT3_Pos         ( 11 )                                                 /*!< SYS_INT_T::NMIEN: EINT3 Position          */
#define SYS_NMIEN_EINT3_Msk         ( 0x1ul << SYS_NMIEN_EINT3_Pos )                       /*!< SYS_INT_T::NMIEN: EINT3 Mask              */

#define SYS_NMIEN_EINT4_Pos         ( 12 )                                                 /*!< SYS_INT_T::NMIEN: EINT4 Position          */
#define SYS_NMIEN_EINT4_Msk         ( 0x1ul << SYS_NMIEN_EINT4_Pos )                       /*!< SYS_INT_T::NMIEN: EINT4 Mask              */

#define SYS_NMIEN_EINT5_Pos         ( 13 )                                                 /*!< SYS_INT_T::NMIEN: EINT5 Position          */
#define SYS_NMIEN_EINT5_Msk         ( 0x1ul << SYS_NMIEN_EINT5_Pos )                       /*!< SYS_INT_T::NMIEN: EINT5 Mask              */

#define SYS_NMIEN_UART0INT_Pos      ( 14 )                                                 /*!< SYS_INT_T::NMIEN: UART0INT Position       */
#define SYS_NMIEN_UART0INT_Msk      ( 0x1ul << SYS_NMIEN_UART0INT_Pos )                    /*!< SYS_INT_T::NMIEN: UART0INT Mask           */

#define SYS_NMIEN_UART1INT_Pos      ( 15 )                                                 /*!< SYS_INT_T::NMIEN: UART1INT Position       */
#define SYS_NMIEN_UART1INT_Msk      ( 0x1ul << SYS_NMIEN_UART1INT_Pos )                    /*!< SYS_INT_T::NMIEN: UART1INT Mask           */

#define SYS_NMIEN_EINT6_Pos         ( 16 )                                                 /*!< SYS_INT_T::NMIEN: EINT6 Position          */
#define SYS_NMIEN_EINT6_Msk         ( 0x1ul << SYS_NMIEN_EINT6_Pos )                       /*!< SYS_INT_T::NMIEN: EINT6 Mask              */

#define SYS_NMIEN_EINT7_Pos         ( 17 )                                                 /*!< SYS_INT_T::NMIEN: EINT7 Position          */
#define SYS_NMIEN_EINT7_Msk         ( 0x1ul << SYS_NMIEN_EINT7_Pos )                       /*!< SYS_INT_T::NMIEN: EINT7 Mask              */

#define SYS_NMISTS_BODOUT_Pos       ( 0 )                                                  /*!< SYS_INT_T::NMISTS: BODOUT Position        */
#define SYS_NMISTS_BODOUT_Msk       ( 0x1ul << SYS_NMISTS_BODOUT_Pos )                     /*!< SYS_INT_T::NMISTS: BODOUT Mask            */

#define SYS_NMISTS_IRCINT_Pos       ( 1 )                                                  /*!< SYS_INT_T::NMISTS: IRCINT Position        */
#define SYS_NMISTS_IRCINT_Msk       ( 0x1ul << SYS_NMISTS_IRCINT_Pos )                     /*!< SYS_INT_T::NMISTS: IRCINT Mask            */

#define SYS_NMISTS_PWRWUINT_Pos     ( 2 )                                                  /*!< SYS_INT_T::NMISTS: PWRWUINT Position      */
#define SYS_NMISTS_PWRWUINT_Msk     ( 0x1ul << SYS_NMISTS_PWRWUINT_Pos )                   /*!< SYS_INT_T::NMISTS: PWRWUINT Mask          */

#define SYS_NMISTS_SRAMPERR_Pos     ( 3 )                                                  /*!< SYS_INT_T::NMISTS: SRAMPERR Position      */
#define SYS_NMISTS_SRAMPERR_Msk     ( 0x1ul << SYS_NMISTS_SRAMPERR_Pos )                   /*!< SYS_INT_T::NMISTS: SRAMPERR Mask          */

#define SYS_NMISTS_CLKFAIL_Pos      ( 4 )                                                  /*!< SYS_INT_T::NMISTS: CLKFAIL Position       */
#define SYS_NMISTS_CLKFAIL_Msk      ( 0x1ul << SYS_NMISTS_CLKFAIL_Pos )                    /*!< SYS_INT_T::NMISTS: CLKFAIL Mask           */

