FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/sys_reg.h
#define SYS_NMISTS_RTCINT_Pos       ( 6 )                                                  /*!< SYS_INT_T::NMISTS: RTCINT Position        */
#define SYS_NMISTS_RTCINT_Msk       ( 0x1ul << SYS_NMISTS_RTCINT_Pos )                     /*!< SYS_INT_T::NMISTS: RTCINT Mask            */

#define SYS_NMISTS_TAMPERINT_Pos    ( 7 )                                                  /*!< SYS_INT_T::NMISTS: TAMPERINT Position     */
#define SYS_NMISTS_TAMPERINT_Msk    ( 0x1ul << SYS_NMISTS_TAMPERINT_Pos )                  /*!< SYS_INT_T::NMISTS: TAMPERINT Mask         */

#define SYS_NMISTS_EINT0_Pos        ( 8 )                                                  /*!< SYS_INT_T::NMISTS: EINT0 Position         */
#define SYS_NMISTS_EINT0_Msk        ( 0x1ul << SYS_NMISTS_EINT0_Pos )                      /*!< SYS_INT_T::NMISTS: EINT0 Mask             */

#define SYS_NMISTS_EINT1_Pos        ( 9 )                                                  /*!< SYS_INT_T::NMISTS: EINT1 Position         */
#define SYS_NMISTS_EINT1_Msk        ( 0x1ul << SYS_NMISTS_EINT1_Pos )                      /*!< SYS_INT_T::NMISTS: EINT1 Mask             */

#define SYS_NMISTS_EINT2_Pos        ( 10 )                                                 /*!< SYS_INT_T::NMISTS: EINT2 Position         */
#define SYS_NMISTS_EINT2_Msk        ( 0x1ul << SYS_NMISTS_EINT2_Pos )                      /*!< SYS_INT_T::NMISTS: EINT2 Mask             */

#define SYS_NMISTS_EINT3_Pos        ( 11 )                                                 /*!< SYS_INT_T::NMISTS: EINT3 Position         */
#define SYS_NMISTS_EINT3_Msk        ( 0x1ul << SYS_NMISTS_EINT3_Pos )                      /*!< SYS_INT_T::NMISTS: EINT3 Mask             */

#define SYS_NMISTS_EINT4_Pos        ( 12 )                                                 /*!< SYS_INT_T::NMISTS: EINT4 Position         */
#define SYS_NMISTS_EINT4_Msk        ( 0x1ul << SYS_NMISTS_EINT4_Pos )                      /*!< SYS_INT_T::NMISTS: EINT4 Mask             */

#define SYS_NMISTS_EINT5_Pos        ( 13 )                                                 /*!< SYS_INT_T::NMISTS: EINT5 Position         */
#define SYS_NMISTS_EINT5_Msk        ( 0x1ul << SYS_NMISTS_EINT5_Pos )                      /*!< SYS_INT_T::NMISTS: EINT5 Mask             */

#define SYS_NMISTS_UART0INT_Pos     ( 14 )                                                 /*!< SYS_INT_T::NMISTS: UART0_INT Position     */
#define SYS_NMISTS_UART0INT_Msk     ( 0x1ul << SYS_NMISTS_UART0INT_Pos )                   /*!< SYS_INT_T::NMISTS: UART0_INT Mask         */

#define SYS_NMISTS_UART1INT_Pos     ( 15 )                                                 /*!< SYS_INT_T::NMISTS: UART1_INT Position     */
#define SYS_NMISTS_UART1INT_Msk     ( 0x1ul << SYS_NMISTS_UART1INT_Pos )                   /*!< SYS_INT_T::NMISTS: UART1_INT Mask         */

#define SYS_NMISTS_EINT6_Pos        ( 16 )                                                 /*!< SYS_INT_T::NMISTS: EINT6 Position         */
#define SYS_NMISTS_EINT6_Msk        ( 0x1ul << SYS_NMISTS_EINT6_Pos )                      /*!< SYS_INT_T::NMISTS: EINT6 Mask             */

#define SYS_NMISTS_EINT7_Pos        ( 17 )                                                 /*!< SYS_INT_T::NMISTS: EINT7 Position         */
#define SYS_NMISTS_EINT7_Msk        ( 0x1ul << SYS_NMISTS_EINT7_Pos )                      /*!< SYS_INT_T::NMISTS: EINT7 Mask             */


/**@}*/ /* INT_CONST */
/**@}*/ /* end of SYS register group */
/**@}*/ /* end of REGISTER group */


#endif /* __SYS_REG_H__ */
